app/views/elements/show.html.erb


            <td><%= @group_member ? link_or_group_name(damage_sample.group) : damage_sample.element.tag %></td>
---
SELECT  "elements".* FROM "elements" WHERE "elements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]