app/controllers/drying_methods_controller.rb

SELECT "drying_methods".* FROM "drying_methods"
---
  def index
    @drying_methods = DryingMethod.all

INSERT INTO "drying_methods" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mixto"], ["created_at", 2017-04-02 04:44:10 UTC], ["updated_at", 2017-04-02 04:44:10 UTC]]
---
  def create
    @drying_method = DryingMethod.new(drying_method_params)

    respond_to do |format|
      if @drying_method.save

SELECT  "drying_methods".* FROM "drying_methods" WHERE "drying_methods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_drying_method
      @drying_method = DryingMethod.find(params[:id])