app/controllers/elements_controller.rb

  def index

    @elements = Element.all
---
SELECT "elements".* FROM "elements"

  def create
    @element = Element.new(element_params)
    # NOTE: Cuando permita editar tarja se deberá hacer validacion asi en update
    if Element.find_by(tag: @element.tag)
      redirect_to new_element_path, alert: 'Error: Ya existe producto con esa tarja/folio!'
    elsif @element.save
---
INSERT INTO "elements" ("tag", "process_order", "product_type_id", "drying_method_id", "previous_usda", "ex_tag", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    # La única eliminacion es JefaCC, de productos que no tengan muestras y no hayan pasado por bodega
    # NOTE Esta verificacion si puede eliminar no deberia hacerse en el modelo
    can_destroy, message = can_destroy_this_element?(logged_user, @element)

    if can_destroy
      logger.info {"Deletion: Deleting elemento de tarja: #{@element.tag}"}
      @element.destroy
---
DELETE FROM "elements" WHERE "elements"."id" = $1  [["id", 2]]

    def set_element
      @element = Element.find(params[:id])
---
SELECT  "elements".* FROM "elements" WHERE "elements"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]