app/controllers/humidity_samples_controller.rb

SELECT "humidity_samples".* FROM "humidity_samples"
---
  def index
    @humidity_samples = HumiditySample.all

INSERT INTO "humidity_samples" ("element_id", "responsable", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["element_id", 1], ["responsable", ""], ["state", ""], ["created_at", 2017-04-02 05:17:42 UTC], ["updated_at", 2017-04-02 05:17:42 UTC]]
SELECT  "humidity_samples".* FROM "humidity_samples" ORDER BY "humidity_samples"."id" DESC LIMIT $1  [["LIMIT", 2]]
---
  def create
    @humidity_sample = HumiditySample.new(humidity_sample_params)


    #calculate_state()
    #@humidity_sample.state = "aprobed"

    respond_to do |format|
      if @humidity_sample.save
        format.html { redirect_to new_humidity_sample_path, notice: 'Humidity sample was successfully created.' }
        format.json { render :show, status: :created, location: @humidity_sample }
      else
        @humidity_samples = HumiditySample.last(2)

DELETE FROM "humidity_samples" WHERE "humidity_samples"."id" = $1  [["id", 17]]
---
  def destroy
    @humidity_sample.destroy

SELECT  "humidity_samples".* FROM "humidity_samples" WHERE "humidity_samples"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def set_humidity_sample
      @humidity_sample = HumiditySample.find(params[:id])