app/controllers/product_types_controller.rb

SELECT "product_types".* FROM "product_types"
---
  def index
    @product_types = ProductType.all

INSERT INTO "product_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "TCC"], ["created_at", 2017-04-02 04:44:57 UTC], ["updated_at", 2017-04-02 04:44:57 UTC]]
---
  def create
    @product_type = ProductType.new(product_type_params)

    respond_to do |format|
      if @product_type.save

SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_product_type
      @product_type = ProductType.find(params[:id])